app/controllers/articles_controller.rb

SELECT * FROM "articles"
---
  def index
    @articles = Article.all

SELECT * FROM "articles" WHERE ("articles"."id" = 2053932785)
---
  def show
    @article = Article.find(params[:id])

SELECT * FROM "articles" WHERE ("articles"."id" = 2053932785)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO "articles" ("updated_at", "title", "body", "author_id", "created_at") VALUES('2009-08-16 22:22:35', 'title', 'body', NULL, '2009-08-16 22:22:35')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 2053932785)
UPDATE "articles" SET "author" = 1, "updated_at" = '2009-08-09 23:35:06' WHERE "id" = 2
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
DELETE FROM "articles" WHERE "id" = 1
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy