app/controllers/comments_controller.rb

  def index
    @article = Article.find(params[:article_id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 2053932785)

  def new
    @article = Article.find(params[:article_id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 2053932785)

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("updated_at", "body", "article_id", "user_id", "created_at") VALUES('2009-08-31 00:35:49', NULL, NULL, NULL, '2009-08-31 00:35:49')

  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 2053932785)
UPDATE "comments" SET "body" = 'body 1 - edited', "updated_at" = '2009-08-17 00:01:28' WHERE "id" = 1

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 2053932785)
DELETE FROM "comments" WHERE "id" = 2053932785